cases/shower/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     foamRun;

solver          multiphaseEuler;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10.0;

deltaT          1e-5;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

maxDeltaT       1;

libs
(
    // From the LogMoM repository
    "libLogMoM.so"

    // From the flotationFoam repository
//    "libflotation.so"
);
