cases/shower/0.org/U.salt
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      U.salt;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 -5);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi.salt;
        value           $internalField;
    }

    "wall\_.*"
    {
        type            noSlip;
    }

    sides
    {
        type            symmetry;
    }
}
