cases/shower/0.org/T.salt
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T.salt;
}

dimensions          [0 0 0 1 0 0 0];

internalField       uniform 923;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        phi             phi.salt;
        inletValue      $internalField;
        value           $internalField;
    }

    "wall\_.*"
    {
        type            zeroGradient;
    }

    sides
    {
        type            symmetry;
    }
}
