cases/shower/0.org/alphat.gas
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat.gas;
}

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(in|out)let"
    {
        type            calculated;
        value           $internalField;
    }

    "wall\_.*"
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }

    sides
    {
        type            symmetry;
    }
}
