cases/shower/0.org/epsilon.gas
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon.gas;
}

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1.5e-4;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        phi             phi.salt;
        inletValue      $internalField;
        value           $internalField;
    }

    "wall\_.*"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    sides
    {
        type            symmetry;
    }
}
