cases/shower/0.org/k.gas
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k.gas;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-5;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        phi             phi.salt;
        inletValue      $internalField;
        value           $internalField;
    }

    "wall\_.*"
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    sides
    {
        type            symmetry;
    }
}
