cases/shower/0.org/nut.gas
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut.gas;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-8;

boundaryField
{
    "(in|out)let"
    {
        type            calculated;
        value           $internalField;
    }

    "wall\_.*"
    {
        type            nutkWallFunction;
        value           $internalField;
    }

    sides
    {
        type            symmetry;
    }
}
