cases/shower/system/createZonesDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createZonesDict;
}

inlet
{
    type        cylinder;
    zoneType    face;

    point1      (0 0 2.9999);
    point2      (0 0 3.0001);
    radius      0.05;
}
