cases/shower/system/fvConstraints
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvConstraints;
}

limitp
{
    type	limitPressure;
    min		1e2;
}

limitUWater
{
    type        limitMag;
    max         15.0;
    cellZone    all;
    field       U.salt;
}

limitUAir
{
    type        limitMag;
    max         15.0;
    cellZone    all;
    field       U.gas;
}
